<template>
  <div>
    <router-link to="/guides/asm/"><h5>&lt;- Вертай в зад, обратно к гайдам</h5></router-link>
    <h1>Язык Ассемблера. Предварительная подготовка.</h1>
    <p>Кратенько о том, что это вообще за зверёк и как с ним работать.</p>
    <hr>
    <section>
      <h2>Это что вообще?</h2>
      <p>
        Язык Ассемблера - это, фактически, самый низкоуровневый язык программирования.
        До языка ассемблера был только машинный код, от которого ассемблер по уровню
        абстракции отличается... да никак он не отличается. Просто на месте цифирек
        стоят более понятные человеку букувки, которые потом обрабатывает компилятор.
        Программы состоят из всё тех же прямых команд процессору, без каких-то
        дополнительных упрощений.
      </p>
      <p>
        Языков Ассемблера столько же, сколько процессоров и компиляторов, но
        база у них у всех одинаковая - отличаются они только нюансами в духе
        директив компилятора. Примеры в лабораторных нам приводятся на 16-разрядной версии
        TASM, и, чтобы не маяться фигнёй и не переводить одну запись в другую, я представляю
        вам... *барабанная дробь* Проект по Портабилизации Ассемблерного SDK "Super Portable
        ASM", также известный в узких кругах ограниченных людей, как S.P.A.S.M.
      </p>
      <p>В комплект входят:</p>
      <ul>
        <li>DOSBox</li>
        <li>Borland TASM16</li>
        <li>Набор скриптов, позволяющих удобно заводить сию шарманку</li>
      </ul>
      <p>Всё это расположено в .zip-архиве на 2.4МБ. Версия максимально портативна:
      папка SPASM является корневой и всеобъемлющей папкой проекта, которая позволяет
      ему функционировать корректно вне зависимости от расположения в системе.
      <a href="https://yadi.sk/d/jJNgOD2Wc6D0sg">Ссылочка</a> на скачивание
      сего чуда-юда.</p>
    </section>
    <section>
      <h2>Инструкция по использованию</h2>
      <ol>
        <li>Скачать архив</li>
        <li>Распаковать в любое удобное место</li>
        <li>Расположить файлы с исходным кодом в папке SRC</li>
        <li>Открыть консоль в корневой папке SPASM (Shift + правый клик > Открыть
          окно Powershell здесь)</li>
        <li>Ввести <span class="code">.\&lt;script> &lt;filename></span>, где
        &lt;script> - название скрипта из списка, приведённого ниже, а &lt;filename> -
        имя файла исходного кода без расширения.</li>
      </ol>
      <p>Список скриптов</p>
      <ul>
        <li>build - компиляция</li>
        <li>run - запуск</li>
        <li>debug - отладка</li>
        <li>bar - build and run - сборка и запуск</li>
        <li>bad - build and debug - сборка и отладка</li>
      </ul>
      <p>Пример использования этих Сколковских Технологий:</p>
      <pre v-highlightjs><code class="ps">C:\SPASM> dir SRC
Mode                 LastWriteTime         Length Name
----                 -------------         ------ ----
-a----        18.09.2020     22:55           2062 lab1.asm
-a----        19.09.2020      0:25           4085 lab2.asm
-a----        20.09.2020      0:28           3218 lab3.asm
-a----        24.09.2020     17:17            595 sample.asm

C:\SPASM> .\bar sample  # Собирает и запускает sample.asm в новом окне DOSBox-а</code></pre>
      <p>Sample.asm с примитивным "Hello, World!", кстати, к проекту приложен, как и README.txt.
      Прелюдии на этом можно завершить, пора переходить от слов к делу:
        <router-link to="/guides/asm/lab1">Разбор первой лабораторной</router-link>.</p>
    </section>
  </div>
</template>

<script>
export default {
  name: "ASMGuide0"
}
</script>

<style scoped>
</style>