<template>
  <div>
    <h1>Способы провести аудиенцию с Его Величеством (какое ЧСВ?)</h1>
    <section>
      <p>Тот Самый™ осуществляет не только писательскую деятельность, составляя
      письменные гайды, но и пошаливает на стороне личными объяснениями.
      В случае, когда текстовый материал по той или иной причине не до конца
      понятен или вызывает некоторые вопросы по содержанию/психическому
      здоровью автора, всегда можно спросить у самого автора. Вот небольшой
      списочек мест, где можно меня найти:</p>
      <ul>
        <li><a href="https://t.me/FarmArt">Коммуникационная сеть террористов: @FarmArt</a></li>
        <li><a>Discord: @FarmArt#1531</a></li>
        <li><a href="https://vk.com/farmart">Презренный ВКонтакте</a></li>
      </ul>
      <p>Особо смелые, готовые стоять рядом, слушать нескончаемые и несвязные потоки
      глубоко технической, богатой терминами и устными опечатками речи, на добрую половину
      состоящей из английского, а на злобную четверть - из русского, но матерного, могут подойти
      лично в бомонке. Я это уважаю. А уважение царя - штука недешёвая.</p>
    </section>
  </div>
</template>

<script>
export default {
  name: "Contacts"
}
</script>

<style scoped>

</style>