<template>
  <div class="home">
    <h1>СТП 3: Возмездие, или Бог любит Троицу.</h1>
    <section>
      <p>Его величество Царь возвращается. Случилось.</p>
    </section>
    <section>
      <h2>Опять редизайн? А что не так было?</h2>
      <p>Да откуда я знаю, захотел и поменял. Нашли у кого спрашивать. Я разве похож на человека,
      который может просто оставить что-то в покое, пока работает, и не трогать?</p>
      <p>А если серьёзно, то изменений произошло немало. Кроме очевидных вещей, вроде
      редизайна, это всё переехало из SCG на шаблонах Flask-а в SPA на Vue и Vue Router.
      Для тех, кто не шарит, это типа <i>ну круууууууууууууть.</i></p>
    </section>
    <section>
      <h2>И что тут будет?</h2>
      <p>Тут снова будут появляться всякие ламповые и уютненькие гайдики, которые
      я делаю исключительно по доброй воле, а не из-за необходимости работать за
      преподов бомонки с их клиническим неумением и нежеланием доносить материал :3
      </p>
      <p>Меня очень тянет сказать "И другие плюшки", но как показывает практика, невидимая
      рука рынка лениво отмахивается от этих плюшек, как от мух. Отсюда вывод: до востребования,
      печь булочной нашего предприятия раскочегарена не будет.</p>
    </section>
    <section>
      <h2>А как же... ну, это, понятно короче.</h2>
      <p>Да.</p>
    </section>
  </div>
</template>

<script>
// @ is an alias to /src
export default {
  name: 'Home',
  components: {
  }
}
</script>
